{"version":"https://jsonfeed.org/version/1","title":"Hacker News: Newest","description":"Hacker News RSS","home_page_url":"https://news.ycombinator.com/newest","items":[{"id":"https://news.ycombinator.com/item?id=41164240","title":"Google loses antitrust suit over search deals on phones","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.bloomberg.com/news/articles/2024-08-05/google-loses-doj-antitrust-suit-over-search\"\u003ehttps://www.bloomberg.com/news/articles/2024-08-05/google-loses-doj-antitrust-suit-over-search\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41164240\"\u003ehttps://news.ycombinator.com/item?id=41164240\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 597\u003c/p\u003e\n\u003cp\u003e# Comments: 400\u003c/p\u003e\n","url":"https://www.bloomberg.com/news/articles/2024-08-05/google-loses-doj-antitrust-suit-over-search","external_url":"https://news.ycombinator.com/item?id=41164240","date_published":"2024-08-05T18:58:16Z","author":{"name":"rvz","url":"https://news.ycombinator.com/user?id=rvz"}},{"id":"https://news.ycombinator.com/item?id=41163645","title":"Show HN: Iso20022.js – Create payments in 3 lines of code","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.iso20022js.com/\"\u003ehttps://www.iso20022js.com/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41163645\"\u003ehttps://news.ycombinator.com/item?id=41163645\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 137\u003c/p\u003e\n\u003cp\u003e# Comments: 71\u003c/p\u003e\n","url":"https://www.iso20022js.com/","external_url":"https://news.ycombinator.com/item?id=41163645","date_published":"2024-08-05T17:55:41Z","author":{"name":"svapnil","url":"https://news.ycombinator.com/user?id=svapnil"}},{"id":"https://news.ycombinator.com/item?id=41163382","title":"Launch HN: Airhart Aeronautics (YC S22) – A modern personal airplane","content_html":"\n\u003cp\u003eHey Hacker News! I’m Nikita, founder of Airhart Aeronautics (\u003ca href=\"https://www.airhartaero.com/\"\u003ehttps://www.airhartaero.com/\u003c/a\u003e). We are building an airplane for people who don’t fly airplanes. The goal is to make flying as easy as driving a car—while maintaining a high bar for safety. Here’s a video that shows a bit of our hardware and quite a bit of our software: \u003ca href=\"https://youtu.be/PGJUGUceu8A\" rel=\"nofollow\"\u003ehttps://youtu.be/PGJUGUceu8A\u003c/a\u003e\u003cp\u003eIn the US, trips that are 50-300 miles are almost all done by car because that distance is too short for commercial airlines and too far for public transportation. Thanks to the Wright Brothers we've had aerial transport for over 100 years. The US has over 19,000 airports, and large commercial airplane technology has developed to the point that the planes practically fly themselves. If we already have the infrastructure and the technology, why isn't everyone flying planes?\u003cp\u003eThe problem is that small airplane technology hasn’t innovated and is stuck in the past. Flying a small airplane is complicated, mentally taxing, and dangerous—about 28x more dangerous than driving a car. Outdated airplanes, coupled with outdated flight controls, lead to regular accidents, often due to some form of loss of control. The planes are expensive and margins are small. There is no incentive to innovate within the current market, so we are looking at the new, untapped market of those who don’t think about flying as an option today and making it an option.\u003cp\u003eI first came across this when I learned to fly in 2020. I was learning in a “modern” GA airplane but was immediately struck by the fact that an airplane built in 2018 did not have an engine computer and there was a manual level to control the fuel/air mixture ratio. Starting it on a hot day was like starting a stubborn lawn mower. On top of that, my instructor was telling me all the various ways I could kill myself if I’m not running at 100% concentration for hours on end. This just didn’t sit right with me.\u003cp\u003eAt the time I was working at SpaceX as an avionics engineer, leading the development of the avionics for the fairing recovery program. I also built autonomous aircraft when I was a student at Cornell, where I got a degree in electrical and computer engineering. It was clear to me that the core problem is that airplanes are too unsafe and too complicated to operate which is keeping too many people out of aviation. So, I decided to leave SpaceX and was joined by my long-time friend Brendan (he was a software engineer at Apple at the time; we built autonomous aircraft together at Cornell) to start Airhart to tackle this problem and make flying safer and more accessible.\u003cp\u003eWe are developing a full hardware and software package to change how people fly airplanes. It’s a fly-by-wire control system, meaning instead of mechanical linkages between the pilot’s control stick and the control surfaces, it’s a joystick that sends digital commands to a computer that then moves the control surfaces accordingly with servo actuators. We’re developing all of the hardware ourselves: the computers, the sensors, the actuators–and all of the software that actually does the control. But it’s not just fly-by-wire. On top of it, we are implementing a simplified control scheme that reduces flying the airplane to just one action to perform one maneuver.\u003cp\u003eFor readers who aren’t pilots: all flying is basically coordinating the aircraft pitch, roll, yaw, and throttle to coordinate actions. Something as simple as a level turn to the right means you have to 1) roll the airplane, 2) use your feet on the rudder pedals to keep the turn coordinated, 3) pull back to increase your lift since you are now losing lift in a bank, 4) monitor your airspeed (especially if at slow speeds when coming in to land), 5) monitor your altitude as you’re adjusting your lift in (3), 6) monitor your turn coordination as you adjust it in (2). You are now established in a turn. To return to flying straight and level do those in reverse. And while doing all this, you need to be navigating through complex airpaces and talking to air traffic control over 1940s radio technology. All this together makes it very hard to fly and very easy for a pilot (especially a new pilot) to lose control of the airplane, which is still the leading cause of fatalities in general aviation.\u003cp\u003eWith Airhart Assist (that’s what we call our system), you just push a control stick to the right and the flight computers do all those steps to put you into a coordinated level turn.\u003cp\u003eSo, how does this actually work?\u003cp\u003eThe force-feedback joystick in the plane sends its position to a flight controller (actually 3 that work in parallel for safety and redundancy, more on that later). The flight controller interprets the position as a turn rate or climb rate command (for left/right or forward/back). The flight controller also reads a bunch of sensors (gyroscope, accelerometer, magnetometer, air pressure, GPS, etc) to develop an accurate estimate of the airplane’s state: roll, pitch, yaw, velocity, position, etc. Using the current state from the sensor fusion algorithms and the desired state from the joystick, the controller does a bunch of aerodynamics and control theory math to compute the control surface position necessary to bring the aircraft to the desired state. Mixed into this is error checking, envelope protection, and other various safety measures to make sure the aircraft never enters an unsafe state.\u003cp\u003eUnlike a traditional airplane, it becomes impossible to command the airplane into a stall, a spin, unsafe attitudes, or other bad states. This is the key to the safety of the system: it prevents the common mistakes that pilots make that lead to disastrous consequences.\u003cp\u003eTo make sure that this system is always functioning, everything is single-fault tolerant. That means that there are no single points of failure. Any fault that might occur–a broken wire, a fried resistor, a bitflip in a processor, a random hang in a kernel–does not affect the functionality of the system. This is achieved by having three flight controllers that take in information from two different sets of sensors (we call them “strings”), independently compute the desired actions to take, and vote on what to do. Each string has its own power source, backup battery, networking hardware, and set of critical sensors.\u003cp\u003eThe only real single point of failure is the engine. We only have one, though the engine itself has redundant ignition systems, fuel pumps, controllers, etc. If the engine were to die, the batteries would keep the system running for ~30 minutes, giving you time to make an emergency landing. If the pilot somehow becomes incapacitated, any passenger can initiate an autonomous emergency landing. And if many things go wrong and the system does fail, there’s a full airframe parachute that can be activated to bring the airplane safely to the ground.\u003cp\u003eA lot of people will likely wonder: “isn’t removing stick and rudder skills going to make worse pilots”? Short answer: no. The core of what makes a good pilot isn’t stick and rudder skills; it’s good decision making and risk management. For single pilots in GA, it’s even more important. So we are building a system that will give our pilots the tools to focus entirely on decision making and risk management and remove the distraction of stick and rudder that creates so many problems today. We think stick and rudder skills are definitely a necessity for airline pilots flying hundreds of people on board for the extremely rare cases where emergencies do happen and many people's lives are at risk, but not for an average person flying a four seat airplane to go on a weekend trip to the mountains. Our system makes it impossible to lose control of the airplane, potentially solving 80% of today’s fatal accidents in general aviation.\u003cp\u003eFly-by-wire systems typically cost millions of dollars. We intend to build it for much less. How? By leveraging automotive grade components, clever sensor fusion math so that we can use MEMS gyroscopes that cost \u003c$100 instead of laser-ring gyros that cost $1000 if not $10k, and by a first principles approach to the design of our system. This requires that we build a lot of our own hardware. We’ve developed our own control surface actuators, our own display assemblies, we’re developing our own radios and GPS hardware (an aviation grade GPS can cost upwards of $10k, but it’s the same hardware as in a $20 consumer grade GPS).\u003cp\u003eTo take advantage of this automotive style approach requires scale. Enter the final third of the problem: flying isn’t sexy. Modern airplanes look like they are from the 90s. With our first airplane, the Airhart Sling, we are redesigning the entire UI/UX of the flight deck to make it as easy as possible to use, redesigning the cabin to feel much more like a luxury car than an airplane today, and integrating Airhart Assist to make flying much more accessible and much more inviting. You can see previews of the Airhart Sling on our website, \u003ca href=\"https://www.airhartaero.com/\"\u003ehttps://www.airhartaero.com/\u003c/a\u003e. The sexiness of design is extremely important for the economies of scale of an automotive-style approach to work.\u003cp\u003eThere’s a plethora of other problems that make flying cumbersome: weight and balance worksheets, complicated route planning, talking to ATC, lengthy preflight checks, a fractured system of FBOs, difficult access to instruction, the list goes on. We are working on all of these too, but no amount of extra UI features can solve the fundamental problem that aviating itself is hard. So that’s what we’re solving first.\u003cp\u003eWe want people who don’t think about airplanes as a mode of transportation to start flying and are hoping that Airhart will pave the way. Whether you fly planes today or not, I’d love to hear your thoughts. This is a very exciting topic with lots to discuss so I’m very much looking forward to the conversation!\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41163382\"\u003ehttps://news.ycombinator.com/item?id=41163382\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 286\u003c/p\u003e\n\u003cp\u003e# Comments: 258\u003c/p\u003e\n","url":"https://news.ycombinator.com/item?id=41163382","external_url":"https://news.ycombinator.com/item?id=41163382","date_published":"2024-08-05T17:26:43Z","author":{"name":"n_ermosh","url":"https://news.ycombinator.com/user?id=n_ermosh"}},{"id":"https://news.ycombinator.com/item?id=41162676","title":"A new type of neural network is more interpretable","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://spectrum.ieee.org/kan-neural-network\"\u003ehttps://spectrum.ieee.org/kan-neural-network\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41162676\"\u003ehttps://news.ycombinator.com/item?id=41162676\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 173\u003c/p\u003e\n\u003cp\u003e# Comments: 40\u003c/p\u003e\n","url":"https://spectrum.ieee.org/kan-neural-network","external_url":"https://news.ycombinator.com/item?id=41162676","date_published":"2024-08-05T16:15:19Z","author":{"name":"pseudolus","url":"https://news.ycombinator.com/user?id=pseudolus"}},{"id":"https://news.ycombinator.com/item?id=41162311","title":"Andy Warhol's lost Amiga art found","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://dfarq.homeip.net/andy-warhols-lost-amiga-art-found/\"\u003ehttps://dfarq.homeip.net/andy-warhols-lost-amiga-art-found/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41162311\"\u003ehttps://news.ycombinator.com/item?id=41162311\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 345\u003c/p\u003e\n\u003cp\u003e# Comments: 113\u003c/p\u003e\n","url":"https://dfarq.homeip.net/andy-warhols-lost-amiga-art-found/","external_url":"https://news.ycombinator.com/item?id=41162311","date_published":"2024-08-05T15:33:30Z","author":{"name":"todsacerdoti","url":"https://news.ycombinator.com/user?id=todsacerdoti"}},{"id":"https://news.ycombinator.com/item?id=41162036","title":"WebGL visual programming editor cables.gl is now open source","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://cables.gl/standalone\"\u003ehttps://cables.gl/standalone\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41162036\"\u003ehttps://news.ycombinator.com/item?id=41162036\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 101\u003c/p\u003e\n\u003cp\u003e# Comments: 20\u003c/p\u003e\n","url":"https://cables.gl/standalone","external_url":"https://news.ycombinator.com/item?id=41162036","date_published":"2024-08-05T15:05:21Z","author":{"name":"pandur","url":"https://news.ycombinator.com/user?id=pandur"}},{"id":"https://news.ycombinator.com/item?id=41161947","title":"A 20-something dethroned dotcom CEO that went to work the counter at McDonald's (2000)","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://web.archive.org/web/20040616091238/http://www.heiferman.com/mcd/\"\u003ehttps://web.archive.org/web/20040616091238/http://www.heiferman.com/mcd/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41161947\"\u003ehttps://news.ycombinator.com/item?id=41161947\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 109\u003c/p\u003e\n\u003cp\u003e# Comments: 68\u003c/p\u003e\n","url":"https://web.archive.org/web/20040616091238/http://www.heiferman.com/mcd/","external_url":"https://news.ycombinator.com/item?id=41161947","date_published":"2024-08-05T14:55:21Z","author":{"name":"kamphey","url":"https://news.ycombinator.com/user?id=kamphey"}},{"id":"https://news.ycombinator.com/item?id=41161580","title":"A cryptographically secure bootloader for RISC-V in Rust","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.codethink.co.uk/articles/2024/secure_bootloader/\"\u003ehttps://www.codethink.co.uk/articles/2024/secure_bootloader/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41161580\"\u003ehttps://news.ycombinator.com/item?id=41161580\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 123\u003c/p\u003e\n\u003cp\u003e# Comments: 58\u003c/p\u003e\n","url":"https://www.codethink.co.uk/articles/2024/secure_bootloader/","external_url":"https://news.ycombinator.com/item?id=41161580","date_published":"2024-08-05T14:18:13Z","author":{"name":"fork-bomber","url":"https://news.ycombinator.com/user?id=fork-bomber"}},{"id":"https://news.ycombinator.com/item?id=41160268","title":"Show HN: Pie Menu – a radial menu for macOS","content_html":"\n\u003cp\u003eHi everyone! I'm Marius Hauken, an indie developer, and I'm excited to share my app: Pie Menu. It offers a fresh way to access your favorite menu bar commands and keyboard shortcuts on macOS. By simply pressing a hotkey you choose during setup, a radial menu appears around your cursor, customized to the current active application. This allows you to quickly select commands without having to remember complex shortcuts across different applications.\u003cp\u003ePie Menu comes with a library of preprogrammed commands for popular apps, but you can easily add any app on your computer. We've also created an extensive database at \u003ca href=\"https://www.pie-menu.com/shortcuts\" rel=\"nofollow\"\u003ehttps://www.pie-menu.com/shortcuts\u003c/a\u003e where you can quickly add shortcuts for different programs. If a command lacks a keyboard shortcut, you can always create one through System Preferences \u003e Keyboard \u003e Application Shortcuts.\u003cp\u003eFor now, you can use Apple’s SF Symbols to label your commands, but we plan to include custom symbol sets in the future. You can see and vote on our roadmap at \u003ca href=\"https://www.pie-menu.com/help/roadmap\" rel=\"nofollow\"\u003ehttps://www.pie-menu.com/help/roadmap\u003c/a\u003e.\u003cp\u003eI hope you give Pie Menu a try and find it as useful as I intended!\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41160268\"\u003ehttps://news.ycombinator.com/item?id=41160268\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 168\u003c/p\u003e\n\u003cp\u003e# Comments: 68\u003c/p\u003e\n","url":"https://www.pie-menu.com/","external_url":"https://news.ycombinator.com/item?id=41160268","date_published":"2024-08-05T11:38:51Z","author":{"name":"hauken","url":"https://news.ycombinator.com/user?id=hauken"}},{"id":"https://news.ycombinator.com/item?id=41159680","title":"Apple Intelligence beta flagged a phishing email as \"Priority\"","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://social.panic.com/@cabel/112905175504595751\"\u003ehttps://social.panic.com/@cabel/112905175504595751\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41159680\"\u003ehttps://news.ycombinator.com/item?id=41159680\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 206\u003c/p\u003e\n\u003cp\u003e# Comments: 156\u003c/p\u003e\n","url":"https://social.panic.com/@cabel/112905175504595751","external_url":"https://news.ycombinator.com/item?id=41159680","date_published":"2024-08-05T10:12:04Z","author":{"name":"latexr","url":"https://news.ycombinator.com/user?id=latexr"}},{"id":"https://news.ycombinator.com/item?id=41159372","title":"Japan's Nikkei Posts Biggest Single-Day Fall Since 1987 After Weak U.S. Data","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.wsj.com/finance/stocks/japan-stocks-fall-sharply-after-weak-u-s-jobs-data-yen-strengthening-3903689f\"\u003ehttps://www.wsj.com/finance/stocks/japan-stocks-fall-sharply-after-weak-u-s-jobs-data-yen-strengthening-3903689f\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41159372\"\u003ehttps://news.ycombinator.com/item?id=41159372\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 103\u003c/p\u003e\n\u003cp\u003e# Comments: 113\u003c/p\u003e\n","url":"https://www.wsj.com/finance/stocks/japan-stocks-fall-sharply-after-weak-u-s-jobs-data-yen-strengthening-3903689f","external_url":"https://news.ycombinator.com/item?id=41159372","date_published":"2024-08-05T09:05:48Z","author":{"name":"tosh","url":"https://news.ycombinator.com/user?id=tosh"}},{"id":"https://news.ycombinator.com/item?id=41159180","title":"How Postgres stores data on disk – this one's a page turner","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://drew.silcock.dev/blog/how-postgres-stores-data-on-disk/\"\u003ehttps://drew.silcock.dev/blog/how-postgres-stores-data-on-disk/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41159180\"\u003ehttps://news.ycombinator.com/item?id=41159180\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 404\u003c/p\u003e\n\u003cp\u003e# Comments: 74\u003c/p\u003e\n","url":"https://drew.silcock.dev/blog/how-postgres-stores-data-on-disk/","external_url":"https://news.ycombinator.com/item?id=41159180","date_published":"2024-08-05T08:28:25Z","author":{"name":"drewsberry","url":"https://news.ycombinator.com/user?id=drewsberry"}},{"id":"https://news.ycombinator.com/item?id=41159063","title":"Stop Killing Games","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://eci.ec.europa.eu/045/public/\"\u003ehttps://eci.ec.europa.eu/045/public/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41159063\"\u003ehttps://news.ycombinator.com/item?id=41159063\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 445\u003c/p\u003e\n\u003cp\u003e# Comments: 227\u003c/p\u003e\n","url":"https://eci.ec.europa.eu/045/public/","external_url":"https://news.ycombinator.com/item?id=41159063","date_published":"2024-08-05T08:06:51Z","author":{"name":"r1chardnl","url":"https://news.ycombinator.com/user?id=r1chardnl"}},{"id":"https://news.ycombinator.com/item?id=41157974","title":"Starting Hospice","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://jakeseliger.com/2024/08/04/starting-hospice-the-end/\"\u003ehttps://jakeseliger.com/2024/08/04/starting-hospice-the-end/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41157974\"\u003ehttps://news.ycombinator.com/item?id=41157974\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 841\u003c/p\u003e\n\u003cp\u003e# Comments: 110\u003c/p\u003e\n","url":"https://jakeseliger.com/2024/08/04/starting-hospice-the-end/","external_url":"https://news.ycombinator.com/item?id=41157974","date_published":"2024-08-05T03:35:53Z","author":{"name":"jdkee","url":"https://news.ycombinator.com/user?id=jdkee"}},{"id":"https://news.ycombinator.com/item?id=41157605","title":"Japan stocks plunge as much as 7% as Asia shares extend sell-off","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.cnbc.com/2024/08/05/asia-markets.html\"\u003ehttps://www.cnbc.com/2024/08/05/asia-markets.html\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41157605\"\u003ehttps://news.ycombinator.com/item?id=41157605\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 130\u003c/p\u003e\n\u003cp\u003e# Comments: 120\u003c/p\u003e\n","url":"https://www.cnbc.com/2024/08/05/asia-markets.html","external_url":"https://news.ycombinator.com/item?id=41157605","date_published":"2024-08-05T02:04:21Z","author":{"name":"lossolo","url":"https://news.ycombinator.com/user?id=lossolo"}},{"id":"https://news.ycombinator.com/item?id=41157595","title":"Building Lego Machines to Destroy Tall Lego Towers","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://kottke.org/24/07/building-lego-machines-to-destroy-tall-lego-towers\"\u003ehttps://kottke.org/24/07/building-lego-machines-to-destroy-tall-lego-towers\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41157595\"\u003ehttps://news.ycombinator.com/item?id=41157595\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 248\u003c/p\u003e\n\u003cp\u003e# Comments: 39\u003c/p\u003e\n","url":"https://kottke.org/24/07/building-lego-machines-to-destroy-tall-lego-towers","external_url":"https://news.ycombinator.com/item?id=41157595","date_published":"2024-08-05T02:02:20Z","author":{"name":"dev_tty01","url":"https://news.ycombinator.com/user?id=dev_tty01"}},{"id":"https://news.ycombinator.com/item?id=41157494","title":"How I Program in 2024","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"http://akkartik.name/post/programming-2024\"\u003ehttp://akkartik.name/post/programming-2024\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41157494\"\u003ehttps://news.ycombinator.com/item?id=41157494\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 303\u003c/p\u003e\n\u003cp\u003e# Comments: 249\u003c/p\u003e\n","url":"http://akkartik.name/post/programming-2024","external_url":"https://news.ycombinator.com/item?id=41157494","date_published":"2024-08-05T01:28:39Z","author":{"name":"surprisetalk","url":"https://news.ycombinator.com/user?id=surprisetalk"}},{"id":"https://news.ycombinator.com/item?id=41157192","title":"Uncovered Euripides fragments are 'kind of a big deal'","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.colorado.edu/asmagazine/2024/08/01/uncovered-euripides-fragments-are-kind-big-deal\"\u003ehttps://www.colorado.edu/asmagazine/2024/08/01/uncovered-euripides-fragments-are-kind-big-deal\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41157192\"\u003ehttps://news.ycombinator.com/item?id=41157192\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 196\u003c/p\u003e\n\u003cp\u003e# Comments: 68\u003c/p\u003e\n","url":"https://www.colorado.edu/asmagazine/2024/08/01/uncovered-euripides-fragments-are-kind-big-deal","external_url":"https://news.ycombinator.com/item?id=41157192","date_published":"2024-08-05T00:11:33Z","author":{"name":"caf","url":"https://news.ycombinator.com/user?id=caf"}},{"id":"https://news.ycombinator.com/item?id=41156872","title":"Show HN: Free e-book about WebGPU Programming","content_html":"\n\u003cp\u003eI am excited to announce the launch of my e-book on Graphics/WebGPU programming! This project has consumed much of my spare time, during which I developed various tools to facilitate the publishing process, including a code playground and a static site generator that can reference sample codes.\u003cp\u003eHowever, I'm feeling burnt out and ready to call it finished, even though it may not feel completely done. Avoiding another abandoned side project has been my primary motivation in reaching this point.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41156872\"\u003ehttps://news.ycombinator.com/item?id=41156872\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 422\u003c/p\u003e\n\u003cp\u003e# Comments: 67\u003c/p\u003e\n","url":"https://shi-yan.github.io/webgpuunleashed/","external_url":"https://news.ycombinator.com/item?id=41156872","date_published":"2024-08-04T22:56:22Z","author":{"name":"billconan","url":"https://news.ycombinator.com/user?id=billconan"}},{"id":"https://news.ycombinator.com/item?id=41156793","title":"Age is a simple, modern and secure file encryption tool, format, and Go library","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://github.com/FiloSottile/age\"\u003ehttps://github.com/FiloSottile/age\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=41156793\"\u003ehttps://news.ycombinator.com/item?id=41156793\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 255\u003c/p\u003e\n\u003cp\u003e# Comments: 102\u003c/p\u003e\n","url":"https://github.com/FiloSottile/age","external_url":"https://news.ycombinator.com/item?id=41156793","date_published":"2024-08-04T22:42:39Z","author":{"name":"gjvc","url":"https://news.ycombinator.com/user?id=gjvc"}}]}