{"version":"https://jsonfeed.org/version/1","title":"Hacker News: Newest","description":"Hacker News RSS","home_page_url":"https://news.ycombinator.com/newest","items":[{"id":"https://news.ycombinator.com/item?id=34446704","title":"How to destroy a certificate authority in one month","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://cohost.org/arborelia/post/868933-how-to-destroy-a-cer\"\u003ehttps://cohost.org/arborelia/post/868933-how-to-destroy-a-cer\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34446704\"\u003ehttps://news.ycombinator.com/item?id=34446704\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 128\u003c/p\u003e\n\u003cp\u003e# Comments: 9\u003c/p\u003e\n","url":"https://cohost.org/arborelia/post/868933-how-to-destroy-a-cer","external_url":"https://news.ycombinator.com/item?id=34446704","date_published":"2023-01-19T22:43:11Z","author":{"name":"JoshTriplett","url":"https://news.ycombinator.com/user?id=JoshTriplett"}},{"id":"https://news.ycombinator.com/item?id=34446673","title":"how to completely own an airline in 3 easy steps","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://maia.crimew.gay/posts/how-to-hack-an-airline/\"\u003ehttps://maia.crimew.gay/posts/how-to-hack-an-airline/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34446673\"\u003ehttps://news.ycombinator.com/item?id=34446673\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 106\u003c/p\u003e\n\u003cp\u003e# Comments: 49\u003c/p\u003e\n","url":"https://maia.crimew.gay/posts/how-to-hack-an-airline/","external_url":"https://news.ycombinator.com/item?id=34446673","date_published":"2023-01-19T22:39:12Z","author":{"name":"half-kh-hacker","url":"https://news.ycombinator.com/user?id=half-kh-hacker"}},{"id":"https://news.ycombinator.com/item?id=34445873","title":"ChatRWKV, like ChatGPT but powered by the RWKV (RNN-based, open) language model","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://github.com/BlinkDL/ChatRWKV\"\u003ehttps://github.com/BlinkDL/ChatRWKV\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34445873\"\u003ehttps://news.ycombinator.com/item?id=34445873\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 130\u003c/p\u003e\n\u003cp\u003e# Comments: 27\u003c/p\u003e\n","url":"https://github.com/BlinkDL/ChatRWKV","external_url":"https://news.ycombinator.com/item?id=34445873","date_published":"2023-01-19T21:29:32Z","author":{"name":"maraoz","url":"https://news.ycombinator.com/user?id=maraoz"}},{"id":"https://news.ycombinator.com/item?id=34445702","title":"Twitterrific has been discontinued","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://blog.iconfactory.com/2023/01/twitterrific-end-of-an-era/\"\u003ehttps://blog.iconfactory.com/2023/01/twitterrific-end-of-an-era/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34445702\"\u003ehttps://news.ycombinator.com/item?id=34445702\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 249\u003c/p\u003e\n\u003cp\u003e# Comments: 219\u003c/p\u003e\n","url":"https://blog.iconfactory.com/2023/01/twitterrific-end-of-an-era/","external_url":"https://news.ycombinator.com/item?id=34445702","date_published":"2023-01-19T21:15:09Z","author":{"name":"erickhill","url":"https://news.ycombinator.com/user?id=erickhill"}},{"id":"https://news.ycombinator.com/item?id=34444286","title":"DALL-E for Playlists","content_html":"\n\u003cp\u003eNatural language playlist is an AI tool that generates a Spotify playlist based on your prompt.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34444286\"\u003ehttps://news.ycombinator.com/item?id=34444286\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 164\u003c/p\u003e\n\u003cp\u003e# Comments: 74\u003c/p\u003e\n","url":"https://www.naturallanguageplaylist.com/","external_url":"https://news.ycombinator.com/item?id=34444286","date_published":"2023-01-19T19:11:44Z","author":{"name":"mohsenari","url":"https://news.ycombinator.com/user?id=mohsenari"}},{"id":"https://news.ycombinator.com/item?id=34443629","title":"Tell HN: Coinbase is a joke (product and support)","content_html":"\n\u003cp\u003eI work with Ukrainians and paying some of them has been a challenge, so we decided to give payment via BTC a try.  I got a personal Coinbase account to play around with it, to get more familiar (I had never purchase any crypto until then).  Once I got the account and proved to myself that it should work, I started the process to get a business account.\u003cp\u003eThe business account took a long time to get.  Probably 2 months.  The amount of information they asked for was quite surprising to me.  As a founder, I had never given this level of detail to anyone for any purpose.  I assumed that it was due to regulations Coinbase were under, but honestly, I do not know.  The end goal was important enough that I was willing to go along.\u003cp\u003eOnce I went through the onerous process, I linked our business checking and purchased some BTC and tried to transfer it.  I was told there would be a 13 day hold on the funds before they could be transferred to my consultant.  I went through support and was told to use a debit card and there would be no hold.\u003cp\u003eSince I didn't have a debit card, I had to get one.  After it came, I tried to add it and I got the error: An error occurred / Business cards are not supported.\u003cp\u003eThat was in mid-December.  Here we are in late January and it is still not resolved.  Here's a thumbnail of what has happened in between:\u003cp\u003e- I submitted an email ticket, where they sent me canned responses for the first week or so.  They really never seem to understand the issue.\u003cp\u003e- After a few weeks they finally told me I had a personal account and I couldn't add a business debit card.\u003cp\u003e- I showed them screengrabs of my account proving that it was a business account.\u003cp\u003eAt this point they ghosted me.\u003cp\u003eA week ago I tried a chat on the website.  I explained everything above and it came down to this:\u003cp\u003e\u003e A person can only have either a personal or business account, but not both\u003cp\u003eLet's ignore the fact that they let me open both accounts and never said a word about it.  They even let me connect a debit card to my personal account and a checking account to my business account.\u003cp\u003eNext, they told me if I deleted my personal account I could add the debit card to my business account.  I did that.  No change.\u003cp\u003eI started a chat again and after a long time bumped it up a level and said someone would get in touch with me via email.\u003cp\u003eYesterday I got an email that my new ticket was closed and asked if my issue was resolved.\u003cp\u003eAt this point, I deleted my personal account and my business account is stuck in \"personal\" mode and I can't add a debit card, so the hold time means it's useless.\u003cp\u003eI just want people to know that Coinbase is a complete joke of a company.  Don't use them.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34443629\"\u003ehttps://news.ycombinator.com/item?id=34443629\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 191\u003c/p\u003e\n\u003cp\u003e# Comments: 116\u003c/p\u003e\n","url":"https://news.ycombinator.com/item?id=34443629","external_url":"https://news.ycombinator.com/item?id=34443629","date_published":"2023-01-19T18:21:29Z","author":{"name":"e40","url":"https://news.ycombinator.com/user?id=e40"}},{"id":"https://news.ycombinator.com/item?id=34443471","title":"Stock market charts you never saw (2021)","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3050736\"\u003ehttps://papers.ssrn.com/sol3/papers.cfm?abstract_id=3050736\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34443471\"\u003ehttps://news.ycombinator.com/item?id=34443471\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 285\u003c/p\u003e\n\u003cp\u003e# Comments: 148\u003c/p\u003e\n","url":"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3050736","external_url":"https://news.ycombinator.com/item?id=34443471","date_published":"2023-01-19T18:07:31Z","author":{"name":"dot1x","url":"https://news.ycombinator.com/user?id=dot1x"}},{"id":"https://news.ycombinator.com/item?id=34442647","title":"Amazon ends charity donation program AmazonSmile","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://techcrunch.com/2023/01/19/amazon-ends-charity-donation-program-amazonsmile/\"\u003ehttps://techcrunch.com/2023/01/19/amazon-ends-charity-donation-program-amazonsmile/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34442647\"\u003ehttps://news.ycombinator.com/item?id=34442647\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 304\u003c/p\u003e\n\u003cp\u003e# Comments: 191\u003c/p\u003e\n","url":"https://techcrunch.com/2023/01/19/amazon-ends-charity-donation-program-amazonsmile/","external_url":"https://news.ycombinator.com/item?id=34442647","date_published":"2023-01-19T17:02:12Z","author":{"name":"m-watson","url":"https://news.ycombinator.com/user?id=m-watson"}},{"id":"https://news.ycombinator.com/item?id=34442603","title":"Launch HN: Odigos (YC W23) – Instant distributed tracing for Kubernetes clusters","content_html":"\n\u003cp\u003eHi HN! We’re Eden and Ari, co-founders of Odigos (\u003ca href=\"https://github.com/keyval-dev/odigos\"\u003ehttps://github.com/keyval-dev/odigos\u003c/a\u003e). Odigos is an open-source project that lets you instantly generate distributed traces for your applications. It works alongside existing monitoring tools and does not require any code changes.\u003cp\u003eOur earlier experiences with monitoring tools were frustrating. Monitoring a distributed system with multiple microservices, we found ourselves spending way too much time trying to locate the specific microservice that was at the root of a problem. For example, we once spent hours debugging an application which we suspected was causing high latency, only to find out that the actual problem was rooted in a completely different application\u003cp\u003eThen we learned about distributed tracing, which solves exactly this problem. As opposed to metrics or logs that capture a data point in time in a single application, a distributed trace follows a request as it propagates through a distributed environment by tagging it with a unique ID. This allows developers to understand the context of each request and how their distributed applications work.\u003cp\u003eThe downside is that it is difficult to implement. Unlike metrics or logs, the value of distributed tracing is gained only after implementing it across multiple applications. If even one of your applications does not produce distributed tracing, the context propagation is broken and the value of the traces drops significantly.\u003cp\u003eWe manually implemented distributed tracing for multiple companies, but found it a challenge to coordinate all the development teams to instrument their applications in order to achieve a complete distributed trace. Once the implementation was finished, we saw great value and fixed production issues much faster. But partial implementation wasn’t worth much.\u003cp\u003eWe set out to find a way to automate this process. We knew how to do most of it, but the trickiest part was how to automatically instrument programs written in compiled languages (like Go). If we could do that, we would be able to automate the entire process of generating distributed traces. While researching, we realized that eBPF—a technology that allows the Linux kernel to load external programs for execution within the kernel—could be used to develop automatic instrumentation for compiled languages. That was the final piece of the puzzle, and with it we were able to develop Odigos.\u003cp\u003eOdigos first scans and recognizes all your running applications, then recognizes the programming language of each one and auto-instruments it accordingly, using eBPF and OpenTelemetry. In addition, it deploys collectors that buffer, filter, and deliver data to your chosen monitoring tool, and auto scales them according to the amount of traffic. This automation allows developers to enjoy distributed traces within minutes as opposed to manual effort which can take months to implement.\u003cp\u003eAutomatic instrumentation across programming languages is not a trivial task, especially when dealing with static binaries (like the ones produced by the Go compiler). We built multiple mechanisms to make sure we inject the relevant headers in a secure and stable way. We developed a system that tracks functions and structs across different versions of open-source libraries. In addition, we developed a system that performs userspace memory management in eBPF. As a result, Odigos is the only solution that is able to automatically generate distributed traces for compiled languages like Go and Rust. While other solutions require users to be experts in OpenTelemetry or eBPF, our solution does not require prior knowledge of observability technologies.\u003cp\u003eOur solution can be installed on any Kubernetes cluster by executing a single command. Once installed, we detect the programming language of every running application and apply the relevant instrumentation. For JIT languages (Java and .NET) or interpreted languages (JavaScript and Python) we deploy the OpenTelemetry instrumentation. For compiled languges (Go, Rust, C) we deploy our eBPF-based instrumentation. All of this is abstracted from the user, who only has to: (1) select any or all of the target applications and (2) select a backend to send the monitoring data to.\u003cp\u003eIn May 2022, we released our first open-source project: automatic instrumentation for Go applications, based on eBPF. We later donated this project to the OpenTelemetry community and it is currently being developed as part of the Go Automatic Instrumentation SIG.\u003cp\u003eWe are big believers in open standards, therefore the instrumentation and collectors used by Odigos are all based on open-source projects developed by the OpenTelemetry community. This also enables us to be vendor-agnostic.\u003cp\u003eCurrently we are focused on building our open-source project. There are no pricing or paid features as of yet, but in the future, we are planning to offer a managed version of Odigos that will include enterprise features.\u003cp\u003eIf you're interested to learn more, check out our docs (\u003ca href=\"https://docs.odigos.io\" rel=\"nofollow\"\u003ehttps://docs.odigos.io\u003c/a\u003e), watch a demo video (\u003ca href=\"https://www.youtube.com/watch?v=9d36AmVtuGU\"\u003ehttps://www.youtube.com/watch?v=9d36AmVtuGU\u003c/a\u003e), and visit our website (\u003ca href=\"https://odigos.io\" rel=\"nofollow\"\u003ehttps://odigos.io\u003c/a\u003e).\u003cp\u003eWe’d love to hear your experiences with tracing and monitoring distributed applications and anything else you’d like to share!\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34442603\"\u003ehttps://news.ycombinator.com/item?id=34442603\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 106\u003c/p\u003e\n\u003cp\u003e# Comments: 25\u003c/p\u003e\n","url":"https://news.ycombinator.com/item?id=34442603","external_url":"https://news.ycombinator.com/item?id=34442603","date_published":"2023-01-19T16:59:52Z","author":{"name":"edenfed","url":"https://news.ycombinator.com/user?id=edenfed"}},{"id":"https://news.ycombinator.com/item?id=34442528","title":"A first person shooter in 571 lines of GNU Awk (2016)","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://github.com/TheMozg/awk-raycaster\"\u003ehttps://github.com/TheMozg/awk-raycaster\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34442528\"\u003ehttps://news.ycombinator.com/item?id=34442528\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 269\u003c/p\u003e\n\u003cp\u003e# Comments: 61\u003c/p\u003e\n","url":"https://github.com/TheMozg/awk-raycaster","external_url":"https://news.ycombinator.com/item?id=34442528","date_published":"2023-01-19T16:55:10Z","author":{"name":"nequo","url":"https://news.ycombinator.com/user?id=nequo"}},{"id":"https://news.ycombinator.com/item?id=34442046","title":"Websites selling abortion pills are sharing sensitive data with Google","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.propublica.org/article/websites-selling-abortion-pills-share-sensitive-data-with-google\"\u003ehttps://www.propublica.org/article/websites-selling-abortion-pills-share-sensitive-data-with-google\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34442046\"\u003ehttps://news.ycombinator.com/item?id=34442046\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 147\u003c/p\u003e\n\u003cp\u003e# Comments: 98\u003c/p\u003e\n","url":"https://www.propublica.org/article/websites-selling-abortion-pills-share-sensitive-data-with-google","external_url":"https://news.ycombinator.com/item?id=34442046","date_published":"2023-01-19T16:24:21Z","author":{"name":"runnerup","url":"https://news.ycombinator.com/user?id=runnerup"}},{"id":"https://news.ycombinator.com/item?id=34441697","title":"Tell HN: It is impossible to disable Google 2FA using backup codes","content_html":"\n\u003cp\u003eI would like to inform the HN community, if your plan to recover your Google account in the event of losing your phone is to use a 2FA backup code, or SMS recovery, to remove the old 2FA setup and set up a new 2FA code, that that may not be possible.\u003cp\u003eMy situation:\u003cp\u003eI had 2FA set up with my Google Account through Google Authenticator.\u003cp\u003eI lost my Google Authenticator settings when I broke my phone.\u003cp\u003eI have 2FA backup codes.  These successfully log me into my Google Account.\u003cp\u003eIn order to disable 2FA, or generate new 2FA backup codes, I need to access the 2FA settings page under the Security tab.  When I try to load the Two-factor authentication page, I am forced to re-authenticate with Google.\u003cp\u003eWhen re-authenticating to access the 2FA page, there is no option to enter a 2FA backup code or SMS verification to pass the 2FA challenge.  The only option under \"Choose a way to verify\" is to enter a 2FA code.  Entering a backup code instead of a 2FA code returns an error.\u003cp\u003eWhat am I supposed to do in this situation?\u003cp\u003eYes this is a classic \"maybe I can get support through public shaming\" attempt.  Thanks in advance.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34441697\"\u003ehttps://news.ycombinator.com/item?id=34441697\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 582\u003c/p\u003e\n\u003cp\u003e# Comments: 302\u003c/p\u003e\n","url":"https://news.ycombinator.com/item?id=34441697","external_url":"https://news.ycombinator.com/item?id=34441697","date_published":"2023-01-19T15:58:32Z","author":{"name":"gravitronic","url":"https://news.ycombinator.com/user?id=gravitronic"}},{"id":"https://news.ycombinator.com/item?id=34441346","title":"Show HN: Retool Mobile","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://retool.com/products/mobile\"\u003ehttps://retool.com/products/mobile\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34441346\"\u003ehttps://news.ycombinator.com/item?id=34441346\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 127\u003c/p\u003e\n\u003cp\u003e# Comments: 49\u003c/p\u003e\n","url":"https://retool.com/products/mobile","external_url":"https://news.ycombinator.com/item?id=34441346","date_published":"2023-01-19T15:31:21Z","author":{"name":"dvdhsu","url":"https://news.ycombinator.com/user?id=dvdhsu"}},{"id":"https://news.ycombinator.com/item?id=34440757","title":"Lisa Source Code Release","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://computerhistory.org/blog/the-lisa-apples-most-influential-failure/\"\u003ehttps://computerhistory.org/blog/the-lisa-apples-most-influential-failure/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34440757\"\u003ehttps://news.ycombinator.com/item?id=34440757\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 156\u003c/p\u003e\n\u003cp\u003e# Comments: 42\u003c/p\u003e\n","url":"https://computerhistory.org/blog/the-lisa-apples-most-influential-failure/","external_url":"https://news.ycombinator.com/item?id=34440757","date_published":"2023-01-19T14:41:17Z","author":{"name":"bitsavers","url":"https://news.ycombinator.com/user?id=bitsavers"}},{"id":"https://news.ycombinator.com/item?id=34440228","title":"Nationwide FAA weather reporting outage","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.nco.ncep.noaa.gov/status/messages/\"\u003ehttps://www.nco.ncep.noaa.gov/status/messages/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34440228\"\u003ehttps://news.ycombinator.com/item?id=34440228\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 177\u003c/p\u003e\n\u003cp\u003e# Comments: 213\u003c/p\u003e\n","url":"https://www.nco.ncep.noaa.gov/status/messages/","external_url":"https://news.ycombinator.com/item?id=34440228","date_published":"2023-01-19T13:52:01Z","author":{"name":"flerchin","url":"https://news.ycombinator.com/user?id=flerchin"}},{"id":"https://news.ycombinator.com/item?id=34439883","title":"Telling your inner critic to chill","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.radiatedaily.com/telling-your-inner-critic-to-chill/\"\u003ehttps://www.radiatedaily.com/telling-your-inner-critic-to-chill/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34439883\"\u003ehttps://news.ycombinator.com/item?id=34439883\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 112\u003c/p\u003e\n\u003cp\u003e# Comments: 85\u003c/p\u003e\n","url":"https://www.radiatedaily.com/telling-your-inner-critic-to-chill/","external_url":"https://news.ycombinator.com/item?id=34439883","date_published":"2023-01-19T13:08:31Z","author":{"name":"ktzn","url":"https://news.ycombinator.com/user?id=ktzn"}},{"id":"https://news.ycombinator.com/item?id=34439828","title":"Ask HN: Math books that made you significantly better at math?","content_html":"\n\u003cp\u003eDo you have any special math books that you hold close to your heart because of the value they delivered specifically to you and your mathematical thinking and skills?\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34439828\"\u003ehttps://news.ycombinator.com/item?id=34439828\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 421\u003c/p\u003e\n\u003cp\u003e# Comments: 255\u003c/p\u003e\n","url":"https://news.ycombinator.com/item?id=34439828","external_url":"https://news.ycombinator.com/item?id=34439828","date_published":"2023-01-19T13:01:37Z","author":{"name":"optbuild","url":"https://news.ycombinator.com/user?id=optbuild"}},{"id":"https://news.ycombinator.com/item?id=34439619","title":"Jabber.org has migrated to Prosody IM","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.jabber.org/notices.html\"\u003ehttps://www.jabber.org/notices.html\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34439619\"\u003ehttps://news.ycombinator.com/item?id=34439619\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 132\u003c/p\u003e\n\u003cp\u003e# Comments: 58\u003c/p\u003e\n","url":"https://www.jabber.org/notices.html","external_url":"https://news.ycombinator.com/item?id=34439619","date_published":"2023-01-19T12:32:00Z","author":{"name":"neustradamus","url":"https://news.ycombinator.com/user?id=neustradamus"}},{"id":"https://news.ycombinator.com/item?id=34439588","title":"Plastic to Oil – Produces 80% Oil","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://blest.co.jp/eng/service/be-h/\"\u003ehttps://blest.co.jp/eng/service/be-h/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34439588\"\u003ehttps://news.ycombinator.com/item?id=34439588\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 222\u003c/p\u003e\n\u003cp\u003e# Comments: 241\u003c/p\u003e\n","url":"https://blest.co.jp/eng/service/be-h/","external_url":"https://news.ycombinator.com/item?id=34439588","date_published":"2023-01-19T12:26:44Z","author":{"name":"hochmartinez","url":"https://news.ycombinator.com/user?id=hochmartinez"}},{"id":"https://news.ycombinator.com/item?id=34439525","title":"Photos capture life inside a drop of seawater","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.smithsonianmag.com/science-nature/these-gorgeous-photos-capture-life-inside-drop-seawater-180981297/\"\u003ehttps://www.smithsonianmag.com/science-nature/these-gorgeous-photos-capture-life-inside-drop-seawater-180981297/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=34439525\"\u003ehttps://news.ycombinator.com/item?id=34439525\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 689\u003c/p\u003e\n\u003cp\u003e# Comments: 162\u003c/p\u003e\n","url":"https://www.smithsonianmag.com/science-nature/these-gorgeous-photos-capture-life-inside-drop-seawater-180981297/","external_url":"https://news.ycombinator.com/item?id=34439525","date_published":"2023-01-19T12:17:34Z","author":{"name":"subharmonicon","url":"https://news.ycombinator.com/user?id=subharmonicon"}}]}