{"version":"https://jsonfeed.org/version/1","title":"Hacker News: Newest","description":"Hacker News RSS","home_page_url":"https://news.ycombinator.com/newest","items":[{"id":"https://news.ycombinator.com/item?id=42177767","title":"DOJ will push Google to sell off Chrome","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.bloomberg.com/news/articles/2024-11-18/doj-will-push-google-to-sell-off-chrome-to-break-search-monopoly\"\u003ehttps://www.bloomberg.com/news/articles/2024-11-18/doj-will-push-google-to-sell-off-chrome-to-break-search-monopoly\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42177767\"\u003ehttps://news.ycombinator.com/item?id=42177767\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 214\u003c/p\u003e\n\u003cp\u003e# Comments: 237\u003c/p\u003e\n","url":"https://www.bloomberg.com/news/articles/2024-11-18/doj-will-push-google-to-sell-off-chrome-to-break-search-monopoly","external_url":"https://news.ycombinator.com/item?id=42177767","date_published":"2024-11-18T22:24:07Z","author":{"name":"redm","url":"https://news.ycombinator.com/user?id=redm"}},{"id":"https://news.ycombinator.com/item?id=42175676","title":"Finland and Lithuania Report Severed Undersea Data Cables","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.bloomberg.com/news/articles/2024-11-18/finland-says-subsea-germany-link-serving-data-centers-is-severed\"\u003ehttps://www.bloomberg.com/news/articles/2024-11-18/finland-says-subsea-germany-link-serving-data-centers-is-severed\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42175676\"\u003ehttps://news.ycombinator.com/item?id=42175676\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 171\u003c/p\u003e\n\u003cp\u003e# Comments: 1\u003c/p\u003e\n","url":"https://www.bloomberg.com/news/articles/2024-11-18/finland-says-subsea-germany-link-serving-data-centers-is-severed","external_url":"https://news.ycombinator.com/item?id=42175676","date_published":"2024-11-18T18:58:03Z","author":{"name":"wslh","url":"https://news.ycombinator.com/user?id=wslh"}},{"id":"https://news.ycombinator.com/item?id=42175624","title":"AMD now has more compute on the top 500 than Nvidia","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.nextplatform.com/2024/11/18/amd-now-has-more-compute-on-the-top500-than-nvidia/\"\u003ehttps://www.nextplatform.com/2024/11/18/amd-now-has-more-compute-on-the-top500-than-nvidia/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42175624\"\u003ehttps://news.ycombinator.com/item?id=42175624\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 107\u003c/p\u003e\n\u003cp\u003e# Comments: 64\u003c/p\u003e\n","url":"https://www.nextplatform.com/2024/11/18/amd-now-has-more-compute-on-the-top500-than-nvidia/","external_url":"https://news.ycombinator.com/item?id=42175624","date_published":"2024-11-18T18:54:33Z","author":{"name":"rbanffy","url":"https://news.ycombinator.com/user?id=rbanffy"}},{"id":"https://news.ycombinator.com/item?id=42175023","title":"Fun facts about Google Scholar","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://blog.google/outreach-initiatives/education/google-scholar-20-years/\"\u003ehttps://blog.google/outreach-initiatives/education/google-scholar-20-years/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42175023\"\u003ehttps://news.ycombinator.com/item?id=42175023\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 139\u003c/p\u003e\n\u003cp\u003e# Comments: 79\u003c/p\u003e\n","url":"https://blog.google/outreach-initiatives/education/google-scholar-20-years/","external_url":"https://news.ycombinator.com/item?id=42175023","date_published":"2024-11-18T18:01:18Z","author":{"name":"thepuppet33r","url":"https://news.ycombinator.com/user?id=thepuppet33r"}},{"id":"https://news.ycombinator.com/item?id=42174840","title":"Unreal 5.5 is a big deal [video]","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.youtube.com/watch?v=BcmUZpdChhA\"\u003ehttps://www.youtube.com/watch?v=BcmUZpdChhA\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42174840\"\u003ehttps://news.ycombinator.com/item?id=42174840\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 110\u003c/p\u003e\n\u003cp\u003e# Comments: 56\u003c/p\u003e\n","url":"https://www.youtube.com/watch?v=BcmUZpdChhA","external_url":"https://news.ycombinator.com/item?id=42174840","date_published":"2024-11-18T17:44:48Z","author":{"name":"RobinHirst11","url":"https://news.ycombinator.com/user?id=RobinHirst11"}},{"id":"https://news.ycombinator.com/item?id=42174829","title":"Show HN: FastGraphRAG – Better RAG using good old PageRank","content_html":"\n\u003cp\u003eHey there HN! We’re Antonio, Luca, and Yuhang, and we’re excited to introduce Fast GraphRAG, an open-source RAG approach that leverages knowledge graphs and the 25 years old PageRank for better information retrieval and reasoning.\u003cp\u003eBuilding a good RAG pipeline these days takes a lot of manual optimizations. Most engineers intuitively start from naive RAG: throw everything in a vector database and hope that semantic search is powerful enough. This can work for use cases where accuracy isn’t too important and hallucinations are tolerable, but it doesn’t work for more difficult queries that involve multi-hop reasoning or more advanced domain understanding. Also, it’s impossible to debug it.\u003cp\u003eTo address these limitations, many engineers find themselves adding extra layers like agent-based preprocessing, custom embeddings, reranking mechanisms, and hybrid search strategies. Much like the early days of machine learning when we manually crafted feature vectors to squeeze out marginal gains, building an effective RAG system often becomes an exercise in crafting engineering “hacks.”\u003cp\u003eEarlier this year, Microsoft seeded the idea of using Knowledge Graphs for RAG and published GraphRAG - i.e. RAG with Knowledge Graphs. We believe that there is an incredible potential in this idea, but existing implementations are naive in the way they create and explore the graph. That’s why we developed Fast GraphRAG with a new algorithmic approach using good old PageRank.\u003cp\u003eThere are two main challenges when building a reliable RAG system:\u003cp\u003e(1) Data Noise: Real-world data is often messy. Customer support tickets, chat logs, and other conversational data can include a lot of irrelevant information. If you push noisy data into a vector database, you’re likely to get noisy results.\u003cp\u003e(2) Domain Specialization: For complex use cases, a RAG system must understand the domain-specific context. This requires creating representations that capture not just the words but the deeper relationships and structures within the data.\u003cp\u003eOur solution builds on these insights by incorporating knowledge graphs into the RAG pipeline. Knowledge graphs store entities and their relationships, and can help structure data in a way that enables more accurate and context-aware information retrieval. 12 years ago Google announced the knowledge graph we all know about [1]. It was a pioneering move. Now we have LLMs, meaning that people can finally do RAG on their own data with tools that can be as powerful as Google’s original idea.\u003cp\u003eBefore we built this, Antonio was at Amazon, while Luca and Yuhang were finishing their PhDs at Oxford. We had been thinking about this problem for years and we always loved the parallel between pagerank and the human memory [2]. We believe that searching for memories is incredibly similar to searching the web.\u003cp\u003eHere’s how it works:\u003cp\u003e- Entity and Relationship Extraction: Fast GraphRAG uses LLMs to extract entities and their relationships from your data and stores them in a graph format [3].\u003cp\u003e- Query Processing: When you make a query, Fast GraphRAG starts by finding the most relevant entities using vector search, then runs a personalized PageRank algorithm to determine the most important “memories” or pieces of information related to the query [4].\u003cp\u003e- Incremental Updates: Unlike other graph-based RAG systems, Fast GraphRAG natively supports incremental data insertions. This means you can continuously add new data without reprocessing the entire graph.\u003cp\u003e- Faster: These design choices make our algorithm faster and more affordable to run than other graph-based RAG systems because we eliminate the need for communities and clustering.\u003cp\u003eSuppose you’re analyzing a book and want to focus on character interactions, locations, and significant events:\u003cp\u003e\u003cpre\u003e\u003ccode\u003e  from fast_graphrag import GraphRAG\n  \n  DOMAIN = \"Analyze this story and identify the characters. Focus on how they interact with each other, the locations they explore, and their relationships.\"\n  \n  EXAMPLE_QUERIES = [\n      \"What is the significance of Christmas Eve in A Christmas Carol?\",\n      \"How does the setting of Victorian London contribute to the story's themes?\",\n      \"Describe the chain of events that leads to Scrooge's transformation.\",\n      \"How does Dickens use the different spirits (Past, Present, and Future) to guide Scrooge?\",\n      \"Why does Dickens choose to divide the story into \\\"staves\\\" rather than chapters?\"\n  ]\n  \n  ENTITY_TYPES = [\"Character\", \"Animal\", \"Place\", \"Object\", \"Activity\", \"Event\"]\n  \n  grag = GraphRAG(\n      working_dir=\"./book_example\",\n      domain=DOMAIN,\n      example_queries=\"\\n\".join(EXAMPLE_QUERIES),\n      entity_types=ENTITY_TYPES\n  )\n  \n  with open(\"./book.txt\") as f:\n      grag.insert(f.read())\n  \n  print(grag.query(\"Who is Scrooge?\").response)\n\u003c/code\u003e\u003c/pre\u003e\nThis code creates a domain-specific knowledge graph based on your data, example queries, and specified entity types. Then you can query it in plain English while it automatically handles all the data fetching, entity extractions, co-reference resolutions, memory elections, etc. When you add new data, locking and checkpointing is handled for you as well.\u003cp\u003eThis is the kind of infrastructure that GenAI apps need to handle large-scale real-world data. Our goal is to give you this infrastructure so that you can focus on what’s important: building great apps for your users without having to care about manually engineering a retrieval pipeline. In the managed service, we also have a suite of UI tools for you to explore and debug your knowledge graph.\u003cp\u003eWe have a free hosted solution with up to 100 monthly requests. When you’re ready to grow, we have paid plans that scale with you. And of course you can self host our open-source engine.\u003cp\u003eGive us a spin today at \u003ca href=\"https://circlemind.co\"\u003ehttps://circlemind.co\u003c/a\u003e and see our code at \u003ca href=\"https://github.com/circlemind-ai/fast-graphrag\"\u003ehttps://github.com/circlemind-ai/fast-graphrag\u003c/a\u003e\u003cp\u003eWe’d love feedback :)\u003cp\u003e[1] \u003ca href=\"https://blog.google/products/search/introducing-knowledge-graph-things-not/\" rel=\"nofollow\"\u003ehttps://blog.google/products/search/introducing-knowledge-gr...\u003c/a\u003e\u003cp\u003e[2] Griffiths, T. L., Steyvers, M., \u0026 Firl, A. (2007). Google and the Mind: Predicting Fluency with PageRank. Psychological Science, 18(12), 1069–1076. \u003ca href=\"http://www.jstor.org/stable/40064705\" rel=\"nofollow\"\u003ehttp://www.jstor.org/stable/40064705\u003c/a\u003e\u003cp\u003e[3] Similarly to Microsoft’s GraphRAG: \u003ca href=\"https://github.com/microsoft/graphrag\"\u003ehttps://github.com/microsoft/graphrag\u003c/a\u003e\u003cp\u003e[4] Similarly to OSU’s HippoRAG: \u003ca href=\"https://github.com/OSU-NLP-Group/HippoRAG\"\u003ehttps://github.com/OSU-NLP-Group/HippoRAG\u003c/a\u003e\u003cp\u003e\u003ca href=\"https://vhs.charm.sh/vhs-4fCicgsbsc7UX0pemOcsMp.gif\" rel=\"nofollow\"\u003ehttps://vhs.charm.sh/vhs-4fCicgsbsc7UX0pemOcsMp.gif\u003c/a\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42174829\"\u003ehttps://news.ycombinator.com/item?id=42174829\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 183\u003c/p\u003e\n\u003cp\u003e# Comments: 57\u003c/p\u003e\n","url":"https://github.com/circlemind-ai/fast-graphrag","external_url":"https://news.ycombinator.com/item?id=42174829","date_published":"2024-11-18T17:43:13Z","author":{"name":"liukidar","url":"https://news.ycombinator.com/user?id=liukidar"}},{"id":"https://news.ycombinator.com/item?id=42174231","title":"MailCatcher runs a super simple SMTP server","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://mailcatcher.me/\"\u003ehttps://mailcatcher.me/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42174231\"\u003ehttps://news.ycombinator.com/item?id=42174231\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 120\u003c/p\u003e\n\u003cp\u003e# Comments: 46\u003c/p\u003e\n","url":"https://mailcatcher.me/","external_url":"https://news.ycombinator.com/item?id=42174231","date_published":"2024-11-18T16:51:29Z","author":{"name":"mooreds","url":"https://news.ycombinator.com/user?id=mooreds"}},{"id":"https://news.ycombinator.com/item?id=42174204","title":"Launch HN: Regatta Storage (YC F24) – Turn S3 into a local-like, POSIX cloud FS","content_html":"\n\u003cp\u003eHey HN, I’m Hunter the founder of Regatta Storage (\u003ca href=\"https://regattastorage.com\"\u003ehttps://regattastorage.com\u003c/a\u003e). Regatta Storage is a new cloud file system that provides unlimited pay-as-you-go capacity, local-like performance, and automatic synchronization to S3-compatible storage. For example, you can use Regatta to instantly access massive data sets in S3 with Spark, Pytorch, or pandas without paying for large, local disks or waiting for the data to download.\u003cp\u003eCheck out an overview of how the service works here: \u003ca href=\"https://www.youtube.com/watch?v=xh1q5p7E4JY\" rel=\"nofollow\"\u003ehttps://www.youtube.com/watch?v=xh1q5p7E4JY\u003c/a\u003e, and you can try it for free at \u003ca href=\"https://regattastorage.com\"\u003ehttps://regattastorage.com\u003c/a\u003e after signing up for an account. We wanted to let you try it without an account, but we figured that “Hacker News shares a file system and S3 bucket” wouldn’t be the best experience for the community.\u003cp\u003eI built Regatta after spending nearly a decade building and operating at-scale cloud storage at places like Amazon’s Elastic File System (EFS) and Netflix. During my 8 years at EFS, I learned a lot about how teams thought about their storage usage. Users frequently told me that they loved how simple and scalable EFS was, and -- like S3 -- they didn’t have to guess how much capacity they needed up front.\u003cp\u003eWhen I got to Netflix, I was surprised that there wasn’t more usage of EFS. If you looked around, it seemed like a natural fit. Every application needed a POSIX file system. Lots of applications had unclear or spikey storage needs. Often, developers wanted their storage to last beyond the lifetime of an individual instance or container. In fact, if you looked across all Netflix applications, some ridiculous amount of money was being spent on \u003ci\u003eempty storage space\u003c/i\u003e because each of these local drives had to be overprovisioned for potential usage.\u003cp\u003eHowever, in many cases, EFS wasn’t the perfect choice for these workloads. Moving workloads from local disks to NFS often encountered performance issues. Further, applications which treated their local disks as ephemeral would have to manually “clean up” left over data in a persistent storage system.\u003cp\u003eAt this point, I realized that there was a missing solution in the cloud storage market which wasn’t being filled by either block or file storage, and I decided to build Regatta.\u003cp\u003eRegatta is a pay-as-you-go cloud file system that automatically expands with your application. Because it automatically synchronizes with S3 using native file formats, you can connect it to existing data sets and use recently written file data directly from S3. When data isn’t actively being used, it’s removed from the Regatta cache, so you only pay for the backing S3 storage. Finally, we’re developing a custom file protocol which allows us to achieve local-like performance for small-file workloads \u003ci\u003eand\u003c/i\u003e Lustre-like scale-out performance for distributed data jobs.\u003cp\u003eUnder the hood, customers mount a Regatta file system by connecting to our fleet of caching instances over NFSv3 (soon, our custom protocol). Our instances then connect to the customer’s S3 bucket on the backend, and provide sub-millisecond cached-read and write performance. This durable cache allows us to provide a strongly consistent, efficient view of the file system to all connected file clients. We can perform challenging operations (like directory renaming) quickly and durably, while they asynchronously propagate to the S3 bucket.\u003cp\u003eWe’re excited to see users share our vision for Regatta. We have teams who are using us to build totally serverless Jupyter notebook servers for their AI researchers who prefer to upload and share data using the S3 web UI. We have teams who are using us as a distributed caching layer on top of S3 for low-latency access to common files. We have teams who are replacing their thin-provisioned Ceph boot volumes with Regatta for significant savings. We can’t wait to see what other things people will build and we hope you’ll give us a try at regattastorage.com.\u003cp\u003eWe’d love to get any early feedback from the community, ideas for future direction, or experiences in this space. I’ll be in the comments for the next few hours to respond!\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42174204\"\u003ehttps://news.ycombinator.com/item?id=42174204\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 289\u003c/p\u003e\n\u003cp\u003e# Comments: 188\u003c/p\u003e\n","url":"https://news.ycombinator.com/item?id=42174204","external_url":"https://news.ycombinator.com/item?id=42174204","date_published":"2024-11-18T16:49:09Z","author":{"name":"huntaub","url":"https://news.ycombinator.com/user?id=huntaub"}},{"id":"https://news.ycombinator.com/item?id=42173233","title":"A BBC navigation bar component broke depending on the external monitor","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.joshtumath.uk/posts/2024-11-08-how-a-bbc-navigation-bar-component-broke-depending-on-which-external-monitor-it-was-on/\"\u003ehttps://www.joshtumath.uk/posts/2024-11-08-how-a-bbc-navigation-bar-component-broke-depending-on-which-external-monitor-it-was-on/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42173233\"\u003ehttps://news.ycombinator.com/item?id=42173233\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 191\u003c/p\u003e\n\u003cp\u003e# Comments: 75\u003c/p\u003e\n","url":"https://www.joshtumath.uk/posts/2024-11-08-how-a-bbc-navigation-bar-component-broke-depending-on-which-external-monitor-it-was-on/","external_url":"https://news.ycombinator.com/item?id=42173233","date_published":"2024-11-18T15:28:57Z","author":{"name":"ulrischa","url":"https://news.ycombinator.com/user?id=ulrischa"}},{"id":"https://news.ycombinator.com/item?id=42173119","title":"Show HN: Tips.io – A Tailwind playground with AI, page management, and theming","content_html":"\n\u003cp\u003eHi HN!\u003cp\u003eMy name is Nick and this is my fun side project. Please lay it on me. HN can think of Tips.io as a cracked out Tailwind Playground that has page management and amazing AI integration.\u003cp\u003eThere are a few core ideas:\u003cp\u003e1) The HTML is the CMS\u003cp\u003eThere are no fields or restrictions. Just hover, click, and start tweaking any HTML. Also, certain elements you click will have special easy edit abilities:\u003cp\u003e- \u003cimg\u003e auto creates an uploader, stock photo picker (or HTML)\u003cp\u003e- \u003cvideo\u003e auto creates an uploader, stock video picker (or HTML)\u003cp\u003e- \u003csvg\u003e auto creates a big icon picker (or HTML)\u003cp\u003e- \u003cdiv class=\"prose\"\u003e auto creates a WYSIWYG Editor (or HTML)\u003cp\u003e2) Slices\u003cp\u003eThink of these as just individual HTML sections of a page or lil baby single-file components. They are self-contained and isolated so you drag them around easily. The real power comes from reuse across your pages and linking them (aka, one HTML footer updates globally). You can also use \"slices\" from any other tips.io project for quickly expanding your site with more design options.\u003cp\u003e3) AI Elements, Not Pages\u003cp\u003eAnother cool concept is you can select any element on an HTML slice an edit that individually vs re-streaming/rebuilding and entire component every time. We support 5 different AI models right now. Some other really intense/cool AI integration is coming soon.\u003cp\u003e4) Tailwind Everything, No Build Step, \u0026 Theming\u003cp\u003eWe have a custom \"themer\" to make creating Tailwind config files near instant with real-time font trying, color palettes/preset trying, and more. All our Tailwind is automatic and requires zero config instantly. The same Tailwind that magic runs client-side will run server-side so quick no one knows a build step is happening. Tailwind and AI are also a match made in heaven.\u003cp\u003eOther features:\u003cp\u003e- Animations\n- Zoomable page tree\n- Basic Forms (yes on your static site!)\n- Analytics\n- Redirects, site passwords, and much more.\u003cp\u003eTech:\u003cp\u003e- 100% Cloudflare Workers\n- Svelte\n- UnoCSS\u003cp\u003eSome resources:\u003cp\u003e- Promo video: \u003ca href=\"https://www.youtube.com/watch?v=s8U2rJJX-rk\" rel=\"nofollow\"\u003ehttps://www.youtube.com/watch?v=s8U2rJJX-rk\u003c/a\u003e\n- Tutorial \u0026 demo video: \u003ca href=\"https://tips.io/tutorial\" rel=\"nofollow\"\u003ehttps://tips.io/tutorial\u003c/a\u003e\n- Just launch: \u003ca href=\"https://new.tips.io\" rel=\"nofollow\"\u003ehttps://new.tips.io\u003c/a\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42173119\"\u003ehttps://news.ycombinator.com/item?id=42173119\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 161\u003c/p\u003e\n\u003cp\u003e# Comments: 43\u003c/p\u003e\n","url":"https://tips.io","external_url":"https://news.ycombinator.com/item?id=42173119","date_published":"2024-11-18T15:19:24Z","author":{"name":"TIPSIO","url":"https://news.ycombinator.com/user?id=TIPSIO"}},{"id":"https://news.ycombinator.com/item?id=42173114","title":"The Skyline algorithm for packing 2D rectangles","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://jvernay.fr/en/blog/skyline-2d-packer/implementation/\"\u003ehttps://jvernay.fr/en/blog/skyline-2d-packer/implementation/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42173114\"\u003ehttps://news.ycombinator.com/item?id=42173114\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 114\u003c/p\u003e\n\u003cp\u003e# Comments: 27\u003c/p\u003e\n","url":"https://jvernay.fr/en/blog/skyline-2d-packer/implementation/","external_url":"https://news.ycombinator.com/item?id=42173114","date_published":"2024-11-18T15:19:05Z","author":{"name":"lapnect","url":"https://news.ycombinator.com/user?id=lapnect"}},{"id":"https://news.ycombinator.com/item?id=42172281","title":"Bhutan, after prioritizing happiness, now faces an existential crisis","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.cbsnews.com/news/bhutan-emigration-crisis-60-minutes/\"\u003ehttps://www.cbsnews.com/news/bhutan-emigration-crisis-60-minutes/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42172281\"\u003ehttps://news.ycombinator.com/item?id=42172281\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 227\u003c/p\u003e\n\u003cp\u003e# Comments: 301\u003c/p\u003e\n","url":"https://www.cbsnews.com/news/bhutan-emigration-crisis-60-minutes/","external_url":"https://news.ycombinator.com/item?id=42172281","date_published":"2024-11-18T13:53:07Z","author":{"name":"nradov","url":"https://news.ycombinator.com/user?id=nradov"}},{"id":"https://news.ycombinator.com/item?id=42171311","title":"Show HN: Documind – Open-source AI tool to turn documents into structured data","content_html":"\n\u003cp\u003eDocumind is an open-source tool that turns documents into structured data using AI.\u003cp\u003eWhat it does:\u003cp\u003e- Extracts specific data from PDFs based on your custom schema\n- Returns clean, structured JSON that's ready to use\n- Works with just a PDF link + your schema definition\u003cp\u003eJust run npm install documind to get started.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42171311\"\u003ehttps://news.ycombinator.com/item?id=42171311\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 146\u003c/p\u003e\n\u003cp\u003e# Comments: 45\u003c/p\u003e\n","url":"https://github.com/DocumindHQ/documind","external_url":"https://news.ycombinator.com/item?id=42171311","date_published":"2024-11-18T10:51:14Z","author":{"name":"Tammilore","url":"https://news.ycombinator.com/user?id=Tammilore"}},{"id":"https://news.ycombinator.com/item?id=42171164","title":"I was banned from the hCaptcha accessibility account for not being blind (2023)","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://michaels.world/2023/11/i-was-banned-from-the-hcaptcha-accessibility-account-for-not-being-blind/\"\u003ehttps://michaels.world/2023/11/i-was-banned-from-the-hcaptcha-accessibility-account-for-not-being-blind/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42171164\"\u003ehttps://news.ycombinator.com/item?id=42171164\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 323\u003c/p\u003e\n\u003cp\u003e# Comments: 228\u003c/p\u003e\n","url":"https://michaels.world/2023/11/i-was-banned-from-the-hcaptcha-accessibility-account-for-not-being-blind/","external_url":"https://news.ycombinator.com/item?id=42171164","date_published":"2024-11-18T10:13:28Z","author":{"name":"blindgeek","url":"https://news.ycombinator.com/user?id=blindgeek"}},{"id":"https://news.ycombinator.com/item?id=42171043","title":"LLaVA-O1: Let Vision Language Models Reason Step-by-Step","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://arxiv.org/abs/2411.10440\"\u003ehttps://arxiv.org/abs/2411.10440\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42171043\"\u003ehttps://news.ycombinator.com/item?id=42171043\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 134\u003c/p\u003e\n\u003cp\u003e# Comments: 26\u003c/p\u003e\n","url":"https://arxiv.org/abs/2411.10440","external_url":"https://news.ycombinator.com/item?id=42171043","date_published":"2024-11-18T09:44:54Z","author":{"name":"lnyan","url":"https://news.ycombinator.com/user?id=lnyan"}},{"id":"https://news.ycombinator.com/item?id=42170740","title":"Reactive HTML Notebooks","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://maxbo.me/a-html-file-is-all-you-need.html\"\u003ehttps://maxbo.me/a-html-file-is-all-you-need.html\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42170740\"\u003ehttps://news.ycombinator.com/item?id=42170740\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 280\u003c/p\u003e\n\u003cp\u003e# Comments: 45\u003c/p\u003e\n","url":"https://maxbo.me/a-html-file-is-all-you-need.html","external_url":"https://news.ycombinator.com/item?id=42170740","date_published":"2024-11-18T08:33:32Z","author":{"name":"california-og","url":"https://news.ycombinator.com/user?id=california-og"}},{"id":"https://news.ycombinator.com/item?id=42170552","title":"Against Best Practices","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.arp242.net/best-practices.html\"\u003ehttps://www.arp242.net/best-practices.html\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42170552\"\u003ehttps://news.ycombinator.com/item?id=42170552\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 195\u003c/p\u003e\n\u003cp\u003e# Comments: 157\u003c/p\u003e\n","url":"https://www.arp242.net/best-practices.html","external_url":"https://news.ycombinator.com/item?id=42170552","date_published":"2024-11-18T07:45:03Z","author":{"name":"ingve","url":"https://news.ycombinator.com/user?id=ingve"}},{"id":"https://news.ycombinator.com/item?id=42169998","title":"We are shutting down Ondsel","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://ondsel.com/blog/goodbye/\"\u003ehttps://ondsel.com/blog/goodbye/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42169998\"\u003ehttps://news.ycombinator.com/item?id=42169998\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 298\u003c/p\u003e\n\u003cp\u003e# Comments: 159\u003c/p\u003e\n","url":"https://ondsel.com/blog/goodbye/","external_url":"https://news.ycombinator.com/item?id=42169998","date_published":"2024-11-18T05:40:58Z","author":{"name":"pabs3","url":"https://news.ycombinator.com/user?id=pabs3"}},{"id":"https://news.ycombinator.com/item?id=42169615","title":"How Japanese black companies oppress workers (2014)","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://www.tofugu.com/japan/japanese-black-companies/\"\u003ehttps://www.tofugu.com/japan/japanese-black-companies/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42169615\"\u003ehttps://news.ycombinator.com/item?id=42169615\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 173\u003c/p\u003e\n\u003cp\u003e# Comments: 218\u003c/p\u003e\n","url":"https://www.tofugu.com/japan/japanese-black-companies/","external_url":"https://news.ycombinator.com/item?id=42169615","date_published":"2024-11-18T04:02:13Z","author":{"name":"rawgabbit","url":"https://news.ycombinator.com/user?id=rawgabbit"}},{"id":"https://news.ycombinator.com/item?id=42169418","title":"Linux kernel 6.12 has been released","content_html":"\n\u003cp\u003eArticle URL: \u003ca href=\"https://lwn.net/Articles/997958/\"\u003ehttps://lwn.net/Articles/997958/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComments URL: \u003ca href=\"https://news.ycombinator.com/item?id=42169418\"\u003ehttps://news.ycombinator.com/item?id=42169418\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePoints: 145\u003c/p\u003e\n\u003cp\u003e# Comments: 38\u003c/p\u003e\n","url":"https://lwn.net/Articles/997958/","external_url":"https://news.ycombinator.com/item?id=42169418","date_published":"2024-11-18T03:12:44Z","author":{"name":"nitinreddy88","url":"https://news.ycombinator.com/user?id=nitinreddy88"}}]}